#pragma once
#include <Arduino.h>

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//								3.1.Контроллеры программной среды ESP32 STAMP
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-
//=================================================================================================
//									STAMP-PICO
//---------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STAMP_PICO) //====КОНТРОЛЛЕР WEMOS D1 MINI ESP32
#define FLPROG_CORE_CODE 127                                  //--Идентификатор выбора платы c кодом платы;
#define FLPROG_CORE_NAME "STAMP-PICO"                         //--Наименование платы;
#define FLPROG_CORE_STAMP_PICO                                //--Идентификатор типа платы [variant.d1_mini32];
#define FLPROG_CORE_ESP                                       //--Идентификатор программной среды для контроллеров ESP;
#define FLPROG_CORE_ESP32                                     //--Идентификатор программной среды для контроллеров ESP32;
#define FLPROG_CORE_ESP32_PICO   
 #define FLPROG_I2CSPEED 400000UL
#endif
//=================================================================================================
